IDEA StatiCa Open Model
OpenModelPropertyAttribute Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Property attribute
Inheritance Hierarchy
System.Object
 System.Attribute
 IdeaRS.OpenModel.OpenModelPropertyAttribute
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public sealed class OpenModelPropertyAttribute : Attribute
Public NotInheritable Class OpenModelPropertyAttribute
	Inherits Attribute
public ref class OpenModelPropertyAttribute sealed : public Attribute
The OpenModelPropertyAttribute type exposes the following members.
Constructors
Name | Description
OpenModelPropertyAttribute
 Constructor
Top
Fields
Name | Description
StructuralModelName
 Name in the Idea model
Top
See Also
Reference
IdeaRS.OpenModel Namespace